# SPARQL queries generated from mergedschema.json

# Leeractiviteit 
SELECT DISTINCT ?Leeractiviteit_url ?heeftDeel_url ?ingerichtDoor_url ?isDeelVan_url ?locatie_url ?periode_url ?specificatie_url ?werklast_url ?type_url ?leermiddel_url ?draagtBijAanHetBehalenVan_url ?kolom2_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/hasPart> ?heeftDeel_url . }
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/directedBy> ?ingerichtDoor_url . }
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/isPartOf> ?isDeelVan_url . }
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/location> ?locatie_url . }
  OPTIONAL { ?Leeractiviteit_url <http://purl.org/dc/terms/temporal> ?periode_url . }
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/specifiedBy> ?specificatie_url . }
  OPTIONAL { ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/workload> ?werklast_url . }
  OPTIONAL { ?Leeractiviteit_url <http://purl.org/dc/terms/type> ?type_url . }
  OPTIONAL { ?Leeractiviteit_url <http://purl.org/dc/terms/references> ?leermiddel_url . }
  OPTIONAL { ?Leeractiviteit_url <http://purl.org/dc/terms/contributor> ?draagtBijAanHetBehalenVan_url . }
  OPTIONAL { ?Leeractiviteit_url <http://test/kolom2> ?kolom2_url . }
}

# Leeractiviteitspecificatie 
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?contacturen_url ?generalisatieVan_url ?heeftDeel_url ?instructietaal_url ?isDeelVan_url ?specialisatieVan_url ?type_url ?draagtBijAanHetBehalenVan_url ?schrijftVoor_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/contactHour> ?contacturen_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/generalisationOf> ?generalisatieVan_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/hasPart> ?heeftDeel_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/language> ?instructietaal_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/isPartOf> ?isDeelVan_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/specialisationOf> ?specialisatieVan_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/type> ?type_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/contributor> ?draagtBijAanHetBehalenVan_url . }
  OPTIONAL { ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/references> ?schrijftVoor_url . }
}

# Leermiddel 
SELECT DISTINCT ?Leermiddel_url ?beschrijving ?instructie ?naam ?vereiste ?benodigdMateriaal ?sleutelwoord ?onderwerp_url ?toegankelijkheid_url ?type_url ?interactieType_url ?instructietaal_url ?resultaat_url ?niveau_url ?kost_url ?formaat_url ?competentie_url ?bron_url ?dient_url ?isLidVan_url ?bestaatUit_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Leermiddel_url <http://purl.org/dc/elements/1.1/description> ?beschrijving . 
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/terms/instructionalMethod> ?instructie . }
  ?Leermiddel_url <http://purl.org/dc/terms/title> ?naam . 
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/terms/requires> ?vereiste . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/material> ?benodigdMateriaal . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/keywords> ?sleutelwoord . }
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/elements/1.1/subject> ?onderwerp_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/accessibilityFeature> ?toegankelijkheid_url . }
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/terms/type> ?type_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/interactivityType> ?interactieType_url . }
  ?Leermiddel_url <http://purl.org/dc/terms/language> ?instructietaal_url . 
  OPTIONAL { ?Leermiddel_url <https://schema.org/result> ?resultaat_url . }
  ?Leermiddel_url <http://purl.org/dc/terms/educationLevel> ?niveau_url . 
  OPTIONAL { ?Leermiddel_url <https://schema.org/estimatedCost> ?kost_url . }
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/terms/format> ?formaat_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/assesses> ?competentie_url . }
  OPTIONAL { ?Leermiddel_url <http://purl.org/dc/elements/1.1/source> ?bron_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/educationalUse> ?dient_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/isPartOf> ?isLidVan_url . }
  OPTIONAL { ?Leermiddel_url <https://schema.org/hasPart> ?bestaatUit_url . }
}

# CreatiefWerk 
SELECT DISTINCT ?CreatiefWerk_url ?auteursrechtJaar ?versie ?publicatiedatum ?auteur_url ?auteursrechtHouder_url ?taal_url ?vereisteTijd_url ?licentie_url ?producent_url ?uitgever_url ?agent_url ?titel WHERE {
  ?CreatiefWerk_url a <https://schema.org/CreativeWork> .
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/copyrightYear> ?auteursrechtJaar . }
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/version> ?versie . }
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/datePublished> ?publicatiedatum . }
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/author> ?auteur_url . }
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/copyrightHolder> ?auteursrechtHouder_url . }
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/inLanguage> ?taal_url . }
  ?CreatiefWerk_url <https://schema.org/timeRequired> ?vereisteTijd_url . 
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/license> ?licentie_url . }
  ?CreatiefWerk_url <https://schema.org/author> ?producent_url . 
  OPTIONAL { ?CreatiefWerk_url <https://schema.org/publisher> ?uitgever_url . }
  OPTIONAL { ?CreatiefWerk_url <http://example.com/heeftAgent> ?agent_url . }
  OPTIONAL { ?CreatiefWerk_url <http://missing.example.com/titel> ?titel . }
}

# Doel 
SELECT DISTINCT ?Doel_url ?beschrijving ?geldigheid_url ?identificator_url ?niveau_url ?gedefinieerdDoor_url ?onderwerp_url ?type_url ?bron_url ?doelgroep_url ?competentie_url ?gerelateerdAan_url ?isSpecialisatieVan_url ?isBrederDan_url ?bestaatUit_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  OPTIONAL { ?Doel_url <http://purl.org/dc/elements/1.1/description> ?beschrijving . }
  ?Doel_url <http://purl.org/dc/terms/valid> ?geldigheid_url . 
  ?Doel_url <http://www.w3.org/ns/adms#identifier> ?identificator_url . 
  OPTIONAL { ?Doel_url <http://purl.org/dc/terms/educationLevel> ?niveau_url . }
  ?Doel_url <http://purl.org/dc/elements/1.1/creator> ?gedefinieerdDoor_url . 
  OPTIONAL { ?Doel_url <http://purl.org/dc/elements/1.1/subject> ?onderwerp_url . }
  ?Doel_url <http://purl.org/dc/terms/type> ?type_url . 
  OPTIONAL { ?Doel_url <http://purl.org/dc/elements/1.1/source> ?bron_url . }
  ?Doel_url <http://purl.org/dc/terms/audience> ?doelgroep_url . 
  OPTIONAL { ?Doel_url <https://schema.org/assesses> ?competentie_url . }
  OPTIONAL { ?Doel_url <http://www.w3.org/2004/02/skos/core#related> ?gerelateerdAan_url . }
  OPTIONAL { ?Doel_url <http://www.w3.org/2004/02/skos/core#narrower> ?isSpecialisatieVan_url . }
  OPTIONAL { ?Doel_url <http://www.w3.org/2004/02/skos/core#broader> ?isBrederDan_url . }
  OPTIONAL { ?Doel_url <http://purl.org/dc/terms/hasPart> ?bestaatUit_url . }
}

# LeermiddelVerzameling 
SELECT DISTINCT ?LeermiddelVerzameling_url ?heeftLid_url WHERE {
  ?LeermiddelVerzameling_url a <https://schema.org/CreativeWorkSeries> .
  OPTIONAL { ?LeermiddelVerzameling_url <https://schema.org/hasPart> ?heeftLid_url . }
}

# Licentie 
SELECT DISTINCT ?Licentie_url ?type_url WHERE {
  ?Licentie_url a <http://purl.org/dc/terms/LicenseDocument> .
  ?Licentie_url <http://purl.org/dc/terms/type> ?type_url . 
}

# LeermiddelElement 
SELECT DISTINCT ?LeermiddelElement_url ?onderdeelVan_url WHERE {
  ?LeermiddelElement_url a <https://schema.org/CreativeWork> .
  OPTIONAL { ?LeermiddelElement_url <https://schema.org/isPartOf> ?onderdeelVan_url . }
}

# Competentie 
SELECT DISTINCT ?Competentie_url ?beschrijving ?naam ?type_url WHERE {
  ?Competentie_url a <https://ec.europa.eu/esco/lod/static/model.html#Skill> .
  ?Competentie_url <http://purl.org/dc/terms/description> ?beschrijving . 
  ?Competentie_url <http://purl.org/dc/terms/title> ?naam . 
  ?Competentie_url <http://purl.org/dc/terms/type> ?type_url . 
}

# KwantitatieveWaarde 
SELECT DISTINCT ?KwantitatieveWaarde_url ?waarde ?eenheid_url WHERE {
  ?KwantitatieveWaarde_url a <https://schema.org/QuantitativeValue> .
  ?KwantitatieveWaarde_url <https://schema.org/value> ?waarde . 
  OPTIONAL { ?KwantitatieveWaarde_url <https://schema.org/unitCode> ?eenheid_url . }
}

# Openingsurenspecificatie 
SELECT DISTINCT ?Openingsurenspecificatie_url ?open ?gesloten ?dagVanDeWeek ?geldigVan ?geldigTot WHERE {
  ?Openingsurenspecificatie_url a <http://schema.org/OpeningHoursSpecification> .
  OPTIONAL { ?Openingsurenspecificatie_url <http://schema.org/opens> ?open . }
  OPTIONAL { ?Openingsurenspecificatie_url <http://schema.org/closes> ?gesloten . }
  OPTIONAL { ?Openingsurenspecificatie_url <http://schema.org/dayOfWeek> ?dagVanDeWeek . }
  OPTIONAL { ?Openingsurenspecificatie_url <http://schema.org/validFrom> ?geldigVan . }
  OPTIONAL { ?Openingsurenspecificatie_url <http://schema.org/validThrough> ?geldigTot . }
}

# Adresvoorstelling 
SELECT DISTINCT ?Adresvoorstelling_url ?busnummer ?locatienaam ?adresgebied ?postnaam ?gemeentenaam ?administratieveEenheidNiveau2 ?administratieveEenheidNiveau1 ?land ?postcode ?volledigAdres ?postbus ?straatnaam ?locatieaanduiding ?huisnummer WHERE {
  ?Adresvoorstelling_url a <http://www.w3.org/ns/locn#Address> .
  OPTIONAL { ?Adresvoorstelling_url <https://vocab.belgif.be/ns/address#AddressRepresentation.boxNumber> ?busnummer . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#locatorName> ?locatienaam . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#addressArea> ?adresgebied . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#postName> ?postnaam . }
  OPTIONAL { ?Adresvoorstelling_url <https://vocab.belgif.be/ns/address#municipalityName> ?gemeentenaam . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#adminUnitL2> ?administratieveEenheidNiveau2 . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#adminUnitL1> ?administratieveEenheidNiveau1 . }
  OPTIONAL { ?Adresvoorstelling_url <https://vocab.belgif.be/ns/address#country> ?land . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#postCode> ?postcode . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#fullAddress> ?volledigAdres . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#poBox> ?postbus . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#thoroughfare> ?straatnaam . }
  OPTIONAL { ?Adresvoorstelling_url <http://www.w3.org/ns/locn#locatorDesignator> ?locatieaanduiding . }
  OPTIONAL { ?Adresvoorstelling_url <https://vocab.belgif.be/ns/address#AddressRepresentation.houseNumber> ?huisnummer . }
}

# Identificator 
SELECT DISTINCT ?Identificator_url ?toegekendDoor_url WHERE {
  ?Identificator_url a <http://www.w3.org/ns/adms#Identifier> .
  OPTIONAL { ?Identificator_url <http://purl.org/dc/terms/creator> ?toegekendDoor_url . }
}

# Geldbedrag 
SELECT DISTINCT ?Geldbedrag_url ?valuta_url WHERE {
  ?Geldbedrag_url a <https://schema.org/MonetaryAmount> .
  ?Geldbedrag_url <http://www.cidoc-crm.org/cidoc-crm/P180_has_currency> ?valuta_url . 
}

# Periode 
SELECT DISTINCT ?Periode_url ?tot_url ?van_url WHERE {
  ?Periode_url a <http://www.w3.org/2006/time#ProperInterval> .
  OPTIONAL { ?Periode_url <http://www.w3.org/2006/time#hasEnd> ?tot_url . }
  OPTIONAL { ?Periode_url <http://www.w3.org/2006/time#hasBeginning> ?van_url . }
}

# Test1 
SELECT DISTINCT ?Test1_url ?test11 ?test12 ?test13 ?test14 WHERE {
  ?Test1_url a <http://test/Test1> .
  OPTIONAL { ?Test1_url <http://test/test1-1> ?test11 . }
  OPTIONAL { ?Test1_url <http://test/test1-2> ?test12 . }
  OPTIONAL { ?Test1_url <http://test/test1-3> ?test13 . }
  OPTIONAL { ?Test1_url <http://missing.example.com/test14> ?test14 . }
}

# Agent 
SELECT DISTINCT ?Agent_url ?leeftijd ?kent_url ?naam WHERE {
  ?Agent_url a <http://xmlns.com/foaf/0.1/Agent> .
  OPTIONAL { ?Agent_url <http://xmlns.com/foaf/0.1/age> ?leeftijd . }
  OPTIONAL { ?Agent_url <http://xmlns.com/foaf/0.1/knows> ?kent_url . }
  OPTIONAL { ?Agent_url <http://missing.example.com/naam> ?naam . }
}

# Boek 
SELECT DISTINCT ?Boek_url ?titel WHERE {
  ?Boek_url a <http://missing.example.com/Boek> .
  OPTIONAL { ?Boek_url <http://missing.example.com/titel> ?titel . }
}

# Example cross-mapping queries

# Join Leeractiviteit → heeftDeel → Leeractiviteit2
SELECT DISTINCT ?Leeractiviteit_url ?Leeractiviteit2_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leeractiviteit2_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/hasPart> ?Leeractiviteit2_url .
}


# Join Leeractiviteit → isDeelVan → Leeractiviteit2
SELECT DISTINCT ?Leeractiviteit_url ?Leeractiviteit2_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leeractiviteit2_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/isPartOf> ?Leeractiviteit2_url .
}

# Join Leeractiviteit → locatie → Adresvoorstelling
SELECT DISTINCT ?Leeractiviteit_url ?Adresvoorstelling_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Adresvoorstelling_url a <http://www.w3.org/ns/locn#Address> .
  ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/location> ?Adresvoorstelling_url .
}


# Join Leeractiviteit → specificatie → Leeractiviteitspecificatie
SELECT DISTINCT ?Leeractiviteit_url ?Leeractiviteitspecificatie_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteit_url <http://data.europa.eu/snb/model/elm/specifiedBy> ?Leeractiviteitspecificatie_url .
}


# Join Leeractiviteit → type → Doelgroep
SELECT DISTINCT ?Leeractiviteit_url ?Doelgroep_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leeractiviteit_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}

# Join Leeractiviteit → leermiddel → Leermiddel
SELECT DISTINCT ?Leeractiviteit_url ?Leermiddel_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Leeractiviteit_url <http://purl.org/dc/terms/references> ?Leermiddel_url .
}

# Join Leeractiviteit → draagtBijAanHetBehalenVan → Doel
SELECT DISTINCT ?Leeractiviteit_url ?Doel_url WHERE {
  ?Leeractiviteit_url a <http://data.europa.eu/snb/model/elm/LearningActivity> .
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Leeractiviteit_url <http://purl.org/dc/terms/contributor> ?Doel_url .
}


# Join Doelgroep → leeftijdstype → Doelgroep2
SELECT DISTINCT ?Doelgroep_url ?Doelgroep2_url WHERE {
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep2_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep_url <http://purl.org/dc/terms/type> ?Doelgroep2_url .
}

# Join Doelgroep → doelgroep → Doelgroep2
SELECT DISTINCT ?Doelgroep_url ?Doelgroep2_url WHERE {
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep2_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep_url <http://purl.org/dc/elements/1.1/type> ?Doelgroep2_url .
}

# Join Doelgroep → onderwijsniveau → Doelgroep2
SELECT DISTINCT ?Doelgroep_url ?Doelgroep2_url WHERE {
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep2_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doelgroep_url <http://purl.org/dc/terms/educationLevel> ?Doelgroep2_url .
}

# Join Leeractiviteitspecificatie → contacturen → Openingsurenspecificatie
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Openingsurenspecificatie_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Openingsurenspecificatie_url a <http://schema.org/OpeningHoursSpecification> .
  ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/contactHour> ?Openingsurenspecificatie_url .
}

# Join Leeractiviteitspecificatie → generalisatieVan → Leeractiviteitspecificatie2
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Leeractiviteitspecificatie2_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie2_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/generalisationOf> ?Leeractiviteitspecificatie2_url .
}

# Join Leeractiviteitspecificatie → heeftDeel → Leeractiviteitspecificatie2
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Leeractiviteitspecificatie2_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie2_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/hasPart> ?Leeractiviteitspecificatie2_url .
}

# Join Leeractiviteitspecificatie → instructietaal → Doelgroep
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Doelgroep_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/language> ?Doelgroep_url .
}

# Join Leeractiviteitspecificatie → isDeelVan → Leeractiviteitspecificatie2
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Leeractiviteitspecificatie2_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie2_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/isPartOf> ?Leeractiviteitspecificatie2_url .
}

# Join Leeractiviteitspecificatie → specialisatieVan → Leeractiviteitspecificatie2
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Leeractiviteitspecificatie2_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie2_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leeractiviteitspecificatie_url <http://data.europa.eu/snb/model/elm/specialisationOf> ?Leeractiviteitspecificatie2_url .
}

# Join Leeractiviteitspecificatie → type → Doelgroep
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Doelgroep_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}

# Join Leeractiviteitspecificatie → draagtBijAanHetBehalenVan → Doel
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Doel_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/contributor> ?Doel_url .
}

# Join Leeractiviteitspecificatie → schrijftVoor → Leermiddel
SELECT DISTINCT ?Leeractiviteitspecificatie_url ?Leermiddel_url WHERE {
  ?Leeractiviteitspecificatie_url a <http://data.europa.eu/snb/model/elm/LearningActivitySpecification> .
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Leeractiviteitspecificatie_url <http://purl.org/dc/terms/references> ?Leermiddel_url .
}

# Join Leermiddel → onderwerp → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/elements/1.1/subject> ?Doelgroep_url .
}

# Join Leermiddel → toegankelijkheid → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <https://schema.org/accessibilityFeature> ?Doelgroep_url .
}

# Join Leermiddel → type → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}

# Join Leermiddel → interactieType → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <https://schema.org/interactivityType> ?Doelgroep_url .
}

# Join Leermiddel → instructietaal → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/terms/language> ?Doelgroep_url .
}

# Join Leermiddel → resultaat → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <https://schema.org/result> ?Doelgroep_url .
}

# Join Leermiddel → niveau → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/terms/educationLevel> ?Doelgroep_url .
}

# Join Leermiddel → kost → Geldbedrag
SELECT DISTINCT ?Leermiddel_url ?Geldbedrag_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Geldbedrag_url a <https://schema.org/MonetaryAmount> .
  ?Leermiddel_url <https://schema.org/estimatedCost> ?Geldbedrag_url .
}

# Join Leermiddel → formaat → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/terms/format> ?Doelgroep_url .
}

# Join Leermiddel → competentie → Competentie
SELECT DISTINCT ?Leermiddel_url ?Competentie_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Competentie_url a <https://ec.europa.eu/esco/lod/static/model.html#Skill> .
  ?Leermiddel_url <https://schema.org/assesses> ?Competentie_url .
}

# Join Leermiddel → bron → Doelgroep
SELECT DISTINCT ?Leermiddel_url ?Doelgroep_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Leermiddel_url <http://purl.org/dc/elements/1.1/source> ?Doelgroep_url .
}

# Join Leermiddel → dient → Doel
SELECT DISTINCT ?Leermiddel_url ?Doel_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Leermiddel_url <https://schema.org/educationalUse> ?Doel_url .
}

# Join Leermiddel → isLidVan → LeermiddelVerzameling
SELECT DISTINCT ?Leermiddel_url ?LeermiddelVerzameling_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?LeermiddelVerzameling_url a <https://schema.org/CreativeWorkSeries> .
  ?Leermiddel_url <https://schema.org/isPartOf> ?LeermiddelVerzameling_url .
}

# Join Leermiddel → bestaatUit → LeermiddelElement
SELECT DISTINCT ?Leermiddel_url ?LeermiddelElement_url WHERE {
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?LeermiddelElement_url a <https://schema.org/CreativeWork> .
  ?Leermiddel_url <https://schema.org/hasPart> ?LeermiddelElement_url .
}



# Join CreatiefWerk → taal → Doelgroep
SELECT DISTINCT ?CreatiefWerk_url ?Doelgroep_url WHERE {
  ?CreatiefWerk_url a <https://schema.org/CreativeWork> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?CreatiefWerk_url <https://schema.org/inLanguage> ?Doelgroep_url .
}


# Join CreatiefWerk → licentie → Licentie
SELECT DISTINCT ?CreatiefWerk_url ?Licentie_url WHERE {
  ?CreatiefWerk_url a <https://schema.org/CreativeWork> .
  ?Licentie_url a <http://purl.org/dc/terms/LicenseDocument> .
  ?CreatiefWerk_url <https://schema.org/license> ?Licentie_url .
}



# Join CreatiefWerk → agent → Agent
SELECT DISTINCT ?CreatiefWerk_url ?Agent_url WHERE {
  ?CreatiefWerk_url a <https://schema.org/CreativeWork> .
  ?Agent_url a <http://xmlns.com/foaf/0.1/Agent> .
  ?CreatiefWerk_url <http://example.com/heeftAgent> ?Agent_url .
}


# Join Doel → identificator → Identificator
SELECT DISTINCT ?Doel_url ?Identificator_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Identificator_url a <http://www.w3.org/ns/adms#Identifier> .
  ?Doel_url <http://www.w3.org/ns/adms#identifier> ?Identificator_url .
}

# Join Doel → niveau → Doelgroep
SELECT DISTINCT ?Doel_url ?Doelgroep_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doel_url <http://purl.org/dc/terms/educationLevel> ?Doelgroep_url .
}


# Join Doel → onderwerp → Doelgroep
SELECT DISTINCT ?Doel_url ?Doelgroep_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doel_url <http://purl.org/dc/elements/1.1/subject> ?Doelgroep_url .
}

# Join Doel → type → Doelgroep
SELECT DISTINCT ?Doel_url ?Doelgroep_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doel_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}

# Join Doel → bron → Doelgroep
SELECT DISTINCT ?Doel_url ?Doelgroep_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Doel_url <http://purl.org/dc/elements/1.1/source> ?Doelgroep_url .
}


# Join Doel → competentie → Competentie
SELECT DISTINCT ?Doel_url ?Competentie_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Competentie_url a <https://ec.europa.eu/esco/lod/static/model.html#Skill> .
  ?Doel_url <https://schema.org/assesses> ?Competentie_url .
}

# Join Doel → gerelateerdAan → Doel2
SELECT DISTINCT ?Doel_url ?Doel2_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel2_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel_url <http://www.w3.org/2004/02/skos/core#related> ?Doel2_url .
}

# Join Doel → isSpecialisatieVan → Doel2
SELECT DISTINCT ?Doel_url ?Doel2_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel2_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel_url <http://www.w3.org/2004/02/skos/core#narrower> ?Doel2_url .
}

# Join Doel → isBrederDan → Doel2
SELECT DISTINCT ?Doel_url ?Doel2_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel2_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel_url <http://www.w3.org/2004/02/skos/core#broader> ?Doel2_url .
}

# Join Doel → bestaatUit → Doel2
SELECT DISTINCT ?Doel_url ?Doel2_url WHERE {
  ?Doel_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel2_url a <http://data.europa.eu/snb/model/elm/LearningAchievement> .
  ?Doel_url <http://purl.org/dc/terms/hasPart> ?Doel2_url .
}

# Join LeermiddelVerzameling → heeftLid → Leermiddel
SELECT DISTINCT ?LeermiddelVerzameling_url ?Leermiddel_url WHERE {
  ?LeermiddelVerzameling_url a <https://schema.org/CreativeWorkSeries> .
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?LeermiddelVerzameling_url <https://schema.org/hasPart> ?Leermiddel_url .
}

# Join Licentie → type → Doelgroep
SELECT DISTINCT ?Licentie_url ?Doelgroep_url WHERE {
  ?Licentie_url a <http://purl.org/dc/terms/LicenseDocument> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Licentie_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}

# Join LeermiddelElement → onderdeelVan → Leermiddel
SELECT DISTINCT ?LeermiddelElement_url ?Leermiddel_url WHERE {
  ?LeermiddelElement_url a <https://schema.org/CreativeWork> .
  ?Leermiddel_url a <https://schema.org/LearningResource> .
  ?LeermiddelElement_url <https://schema.org/isPartOf> ?Leermiddel_url .
}

# Join Competentie → type → Doelgroep
SELECT DISTINCT ?Competentie_url ?Doelgroep_url WHERE {
  ?Competentie_url a <https://ec.europa.eu/esco/lod/static/model.html#Skill> .
  ?Doelgroep_url a <http://www.w3.org/2004/02/skos/core#Concept> .
  ?Competentie_url <http://purl.org/dc/terms/type> ?Doelgroep_url .
}






# Join Agent → kent → Agent2
SELECT DISTINCT ?Agent_url ?Agent2_url WHERE {
  ?Agent_url a <http://xmlns.com/foaf/0.1/Agent> .
  ?Agent2_url a <http://xmlns.com/foaf/0.1/Agent> .
  ?Agent_url <http://xmlns.com/foaf/0.1/knows> ?Agent2_url .
}

